In [1]:
import numpy as np
import pandas as pd

In [2]:
np.nan

nan

In [3]:
np.nan + 0
np.nan > 0

False

La versión 1.0 de pandas incluye un nuevo objeto NA, que es mucho más
general pues, además de interactuar con números, también puede hacerlo con
cadenas de texto u otras variables como las de tipo booleano. Si quieres que
esta nueva definición este incluida entre tus cálculos usa:

In [4]:
pd.options.mode.use_inf_as_na = True       #Para usar Nan con Pandas, no sirve

In [5]:
pd.NA +'Hola mundo'
pd.NA | False

In [6]:
df = pd.DataFrame(np.arange(0, 15).reshape(5, 3), columns=['a', 'b', 'c'])
df

    a   b   c
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [7]:
df['d'] = np.nan
df['e'] = np.arange(15, 20)
df.loc[5,:] = np.nan     #pd.NA   no sirve
df.loc[4,'a'] = np.nan    #pd.NA
df.loc[0,'d'] = 1
df.loc[5,'d'] = 10
df

     a     b     c     d     e
0  0.0   1.0   2.0   1.0  15.0
1  3.0   4.0   5.0   NaN  16.0
2  6.0   7.0   8.0   NaN  17.0
3  9.0  10.0  11.0   NaN  18.0
4  NaN  13.0  14.0   NaN  19.0
5  NaN   NaN   NaN  10.0   NaN

In [8]:
df.isnull()    #isnull (isna), notnull(notna)

       a      b      c      d      e
0  False  False  False  False  False
1  False  False  False   True  False
2  False  False  False   True  False
3  False  False  False   True  False
4   True  False  False   True  False
5   True   True   True  False   True

In [9]:
df.isnull().sum()      #Nan por columnas  axis=0

a    2
b    1
c    1
d    4
e    1
dtype: int64

In [10]:
df.notnull().sum(axis=1)     #Nan por filas

0    5
1    4
2    4
3    4
4    3
5    1
dtype: int64

In [11]:
df.notnull().apply(pd.Series.value_counts)

       a  b  c  d  e
False  2  1  1  4  1
True   4  5  5  2  5

In [12]:
df.size-df.isnull().sum().sum()     #Todo el dataframe

21

In [74]:
df[df['a'].notnull()]          #Filtra valores que no sean nulos por columna

     a     b     c    d     e
0  0.0   1.0   2.0  1.0  15.0
1  3.0   4.0   5.0  NaN  16.0
2  6.0   7.0   8.0  NaN  17.0
3  9.0  10.0  11.0  NaN  18.0

In [75]:
df.dropna()     #Quitar filas con nan de todo el df

     a    b    c    d     e
0  0.0  1.0  2.0  1.0  15.0

In [76]:
df[['a']].dropna()    #Quitar nan de columna en especifico

     a
0  0.0
1  3.0
2  6.0
3  9.0

In [77]:
df['a'].dropna()

0    0.0
1    3.0
2    6.0
3    9.0
Name: a, dtype: float64

In [78]:
df.fillna(0)

     a     b     c     d     e
0  0.0   1.0   2.0   1.0  15.0
1  3.0   4.0   5.0   0.0  16.0
2  6.0   7.0   8.0   0.0  17.0
3  9.0  10.0  11.0   0.0  18.0
4  0.0  13.0  14.0   0.0  19.0
5  0.0   0.0   0.0  10.0   0.0

In [79]:
df.fillna(method="ffill")    #Rellenar con valores de arriba de la columna

     a     b     c     d     e
0  0.0   1.0   2.0   1.0  15.0
1  3.0   4.0   5.0   1.0  16.0
2  6.0   7.0   8.0   1.0  17.0
3  9.0  10.0  11.0   1.0  18.0
4  9.0  13.0  14.0   1.0  19.0
5  9.0  13.0  14.0  10.0  19.0

In [80]:
df.fillna(method="bfill")      #Rellenando con el valor de abajo de la columna

     a     b     c     d     e
0  0.0   1.0   2.0   1.0  15.0
1  3.0   4.0   5.0  10.0  16.0
2  6.0   7.0   8.0  10.0  17.0
3  9.0  10.0  11.0  10.0  18.0
4  NaN  13.0  14.0  10.0  19.0
5  NaN   NaN   NaN  10.0   NaN

In [81]:
df.fillna(method="bfill",axis=1)      #Rellenando con valores de la derecha

      a     b     c     d     e
0   0.0   1.0   2.0   1.0  15.0
1   3.0   4.0   5.0  16.0  16.0
2   6.0   7.0   8.0  17.0  17.0
3   9.0  10.0  11.0  18.0  18.0
4  13.0  13.0  14.0  19.0  19.0
5  10.0  10.0  10.0  10.0   NaN

In [82]:
df

     a     b     c     d     e
0  0.0   1.0   2.0   1.0  15.0
1  3.0   4.0   5.0   NaN  16.0
2  6.0   7.0   8.0   NaN  17.0
3  9.0  10.0  11.0   NaN  18.0
4  NaN  13.0  14.0   NaN  19.0
5  NaN   NaN   NaN  10.0   NaN

In [83]:
fill = pd.Series([100, 101, 102])            #Rellenando con una serie hecha, el df  por medio del indice 
fill

0    100
1    101
2    102
dtype: int64

In [84]:
df['d'] = df['d'].fillna(fill)
df['d']

0      1.0
1    101.0
2    102.0
3      NaN
4      NaN
5     10.0
Name: d, dtype: float64

In [85]:
df

     a     b     c      d     e
0  0.0   1.0   2.0    1.0  15.0
1  3.0   4.0   5.0  101.0  16.0
2  6.0   7.0   8.0  102.0  17.0
3  9.0  10.0  11.0    NaN  18.0
4  NaN  13.0  14.0    NaN  19.0
5  NaN   NaN   NaN   10.0   NaN

In [86]:
df.fillna(df.median())

     a     b     c      d     e
0  0.0   1.0   2.0    1.0  15.0
1  3.0   4.0   5.0  101.0  16.0
2  6.0   7.0   8.0  102.0  17.0
3  9.0  10.0  11.0   55.5  18.0
4  4.5  13.0  14.0   55.5  19.0
5  4.5   7.0   8.0   10.0  17.0

Por último, Pandas también puede interpolar los valores faltantes calculando el valor que puede haber existido en el medio.

In [87]:
df_d = pd.concat([df[['d']], df[['d']].interpolate()],axis=1)
df_d.columns = ['d_antes','d_interpolado']
df_d

   d_antes  d_interpolado
0      1.0       1.000000
1    101.0     101.000000
2    102.0     102.000000
3      NaN      71.333333
4      NaN      40.666667
5     10.0      10.000000